waveshareteam/ESP32-P4-WIFI6-Touch-LCD-4B/firmware/brookesia/components/VideoPlayer/VideoPlayer.cpp
        return true;
    }

    bool VideoPlayer::stopPlaybackTask(TickType_t timeout)
    {
        loop_playback = false;
        is_paused = false;

        if (!play_task_handle) {
            return true;
        }
        if (xTaskGetCurrentTaskHandle() == play_task_handle) {
            return false;
        }

        close_wait_task = xTaskGetCurrentTaskHandle();
        if (!play_task_handle) {
            close_wait_task = nullptr;
            return true;
        }

        if (avi_player_handle) {
            avi_player_play_stop(avi_player_handle);
        }

        bool stopped = ulTaskNotifyTake(pdTRUE, timeout) != 0;
        close_wait_task = nullptr;

        if (!stopped || play_task_handle) {
            ESP_LOGE(ESP_UTILS_LOG_TAG, "Timed out waiting for playback task");
            return false;
        }

        return true;
    }

    esp_err_t VideoPlayer::getAviFileList(const char *dir_path)
    {
        DIR *dir = opendir(dir_path);
        if (!dir)
            return ESP_FAIL;

        struct dirent *entry;
        int count = 0;

        while ((entry = readdir(dir)) != nullptr)
        {
            if (entry->d_type == DT_REG)
            {
                char *ext = strrchr(entry->d_name, '.');
                if (ext && strcasecmp(ext, ".avi") == 0)
                {
                    count++;
                }
            }
        }

        if (count == 0)
        {
            closedir(dir);
            return ESP_FAIL;
        }

        avi_file_list = (char **)malloc(sizeof(char *) * count);
        if (!avi_file_list)
        {
            closedir(dir);
            return ESP_ERR_NO_MEM;
        }

        avi_file_count = count;
        int loaded_count = 0;
        rewinddir(dir);

        while ((entry = readdir(dir)) != nullptr)
        {
            if (entry->d_type == DT_REG)
            {
                char *ext = strrchr(entry->d_name, '.');
                if (ext && strcasecmp(ext, ".avi") == 0)
                {
                    size_t len = strlen(dir_path) + strlen(entry->d_name) + 2;
                    char *full_path = (char *)malloc(len);
                    if (!full_path) {
                        for (int i = 0; i < loaded_count; i++) {
                            free(avi_file_list[i]);
                        }
                        free(avi_file_list);
                        avi_file_list = nullptr;
                        avi_file_count = 0;
                        closedir(dir);
                        return ESP_ERR_NO_MEM;
                    }
                    snprintf(full_path, len, "%s/%s", dir_path, entry->d_name);
                    avi_file_list[loaded_count++] = full_path;
                }
            }
        }

        closedir(dir);
        return ESP_OK;
    }

    esp_err_t VideoPlayer::initDisplayBypass()
    {
#ifdef CONFIG_CACHE_L2_CACHE_LINE_SIZE
        data_cache_line_size = CONFIG_CACHE_L2_CACHE_LINE_SIZE;
#else
        data_cache_line_size = 64;
#endif

        display = lv_display_get_default();
        ESP_RETURN_ON_FALSE(display != nullptr, ESP_ERR_INVALID_STATE, ESP_UTILS_LOG_TAG, "LVGL display is not ready");

        if (ppa_srm_handle == nullptr) {
            ppa_client_config_t ppa_srm_config = {
                .oper_type = PPA_OPERATION_SRM,
            };
            ESP_RETURN_ON_ERROR(ppa_register_client(&ppa_srm_config, &ppa_srm_handle), ESP_UTILS_LOG_TAG, "Register PPA SRM failed");
        }

        ESP_RETURN_ON_ERROR(bsp_touch_new(NULL, &touch_handle), ESP_UTILS_LOG_TAG, "Create touch handle failed");

        ESP_RETURN_ON_ERROR(esp_lv_adapter_set_dummy_draw(display, true), ESP_UTILS_LOG_TAG, "Enable dummy draw failed");
        dummy_enabled = true;

        ESP_RETURN_ON_ERROR(esp_lv_adapter_pause(-1), ESP_UTILS_LOG_TAG, "Pause LVGL failed");
        lvgl_paused = true;

        return ESP_OK;
    }

    void VideoPlayer::deinitDisplayBypass()
    {
        if (lvgl_paused) {
            esp_lv_adapter_resume();
            lvgl_paused = false;
        }

        if (dummy_enabled && display) {
            esp_lv_adapter_set_dummy_draw(display, false);
            dummy_enabled = false;
        }

        if (touch_handle) {
            esp_lcd_touch_del(touch_handle);
            touch_handle = nullptr;
        }

        touch_active = false;
        last_video_width = 0;
        last_video_height = 0;
    }

    esp_err_t VideoPlayer::initJpegDecoder()
    {
        if (jpeg_handle != nullptr)
            return ESP_OK;

        jpeg_dec_config_t config = DEFAULT_JPEG_DEC_CONFIG();
        config.output_type = VIDEO_JPEG_PIXEL_FORMAT;

        jpeg_error_t err = jpeg_dec_open(&config, &jpeg_handle);
        return (err == JPEG_ERR_OK) ? ESP_OK : ESP_FAIL;
    }

    void VideoPlayer::deinitJpegDecoder()
    {
        if (jpeg_handle)
        {
            jpeg_dec_close(jpeg_handle);
            jpeg_handle = nullptr;
        }
    }

    esp_err_t VideoPlayer::ensureJpegOutputBuffer(int out_len)
    {
        if (out_len <= 0) {
            return ESP_ERR_INVALID_SIZE;
        }

        if (jpeg_output_buffer && jpeg_output_buffer_size >= out_len) {
            return ESP_OK;
        }

        releaseJpegOutputBuffer();
        size_t alloc_size = ALIGN_UP(static_cast<size_t>(out_len), 16);
        jpeg_output_buffer = static_cast<uint8_t *>(
            heap_caps_aligned_calloc(16, 1, alloc_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
        if (!jpeg_output_buffer) {
            ESP_LOGE(ESP_UTILS_LOG_TAG, "JPEG output buffer allocation failed: %u bytes", static_cast<unsigned>(alloc_size));
            return ESP_ERR_NO_MEM;
        }

        jpeg_output_buffer_size = static_cast<int>(alloc_size);
        return ESP_OK;
    }

    void VideoPlayer::releaseJpegOutputBuffer()
    {
        if (jpeg_output_buffer) {
            heap_caps_free(jpeg_output_buffer);
            jpeg_output_buffer = nullptr;
            jpeg_output_buffer_size = 0;
        }
    }

    void VideoPlayer::videoCallback(frame_data_t *data, void *arg)
    {
        if (!data || !data->data || data->data_bytes == 0)
            return;

        VideoPlayer *self = static_cast<VideoPlayer *>(arg);

        if (self->initJpegDecoder() != ESP_OK || !self->dummy_enabled || !self->ppa_srm_handle)
            return;

        // Decode each MJPEG frame into a PSRAM buffer, then use PPA SRM to scale it
        // into the next LCD frame buffer without involving LVGL widgets.
        jpeg_dec_io_t io = {
            .inbuf = data->data,
            .inbuf_len = static_cast<int>(data->data_bytes),
            .outbuf = nullptr,
        };

        jpeg_dec_header_info_t info;
        if (jpeg_dec_parse_header(self->jpeg_handle, &io, &info) != JPEG_ERR_OK) {
            ESP_LOGE(ESP_UTILS_LOG_TAG, "JPEG header parse failed");
            return;
        }

