waveshareteam/ESP32-P4-WIFI6-Touch-LCD-4B/firmware/brookesia/components/VideoPlayer/VideoPlayer.cpp
        if (info.width == 0 || info.height == 0) {
            ESP_LOGE(ESP_UTILS_LOG_TAG, "Invalid JPEG frame size: %dx%d", info.width, info.height);
            return;
        }

        int out_len = 0;
        if (jpeg_dec_get_outbuf_len(self->jpeg_handle, &out_len) != JPEG_ERR_OK ||
            self->ensureJpegOutputBuffer(out_len) != ESP_OK) {
            ESP_LOGE(ESP_UTILS_LOG_TAG, "Prepare JPEG output buffer failed");
            return;
        }

        io.outbuf = self->jpeg_output_buffer;
        if (jpeg_dec_process(self->jpeg_handle, &io) != JPEG_ERR_OK) {
            ESP_LOGE(ESP_UTILS_LOG_TAG, "JPEG decode process failed");
            return;
        }

        uint32_t crop_x = 0;
        uint32_t crop_y = 0;
        uint32_t crop_w = info.width;
        uint32_t crop_h = info.height;

        if (static_cast<uint64_t>(info.width) * DISPLAY_HEIGHT >
                static_cast<uint64_t>(info.height) * DISPLAY_WIDTH) {
            crop_w = static_cast<uint32_t>(
                (static_cast<uint64_t>(info.height) * DISPLAY_WIDTH) / DISPLAY_HEIGHT
            );
            crop_x = (info.width - crop_w) / 2;
        } else {
            crop_h = static_cast<uint32_t>(
                (static_cast<uint64_t>(info.width) * DISPLAY_HEIGHT) / DISPLAY_WIDTH
            );
            crop_y = (info.height - crop_h) / 2;
        }

        crop_w = crop_w ? crop_w : 1;
        crop_h = crop_h ? crop_h : 1;
        float scale_x = static_cast<float>(DISPLAY_WIDTH) / static_cast<float>(crop_w);
        float scale_y = static_cast<float>(DISPLAY_HEIGHT) / static_cast<float>(crop_h);

        if (self->last_video_width != info.width || self->last_video_height != info.height) {
            ESP_LOGI(ESP_UTILS_LOG_TAG, "Cover video frame: %dx%d, crop %u,%u %ux%u",
                     info.width, info.height, crop_x, crop_y, crop_w, crop_h);
            self->last_video_width = info.width;
            self->last_video_height = info.height;
        }

        void *lcd_buffer = esp_lv_adapter_dummy_draw_get_free_buf(self->display);
        if (!lcd_buffer) {
            ESP_LOGE(ESP_UTILS_LOG_TAG, "No free LCD frame buffer");
            return;
        }

        memset(lcd_buffer, 0, DISPLAY_WIDTH * DISPLAY_HEIGHT * VIDEO_BYTES_PER_PIXEL);

        ppa_srm_oper_config_t srm_config = {};
        srm_config.in.buffer = self->jpeg_output_buffer;
        srm_config.in.pic_w = info.width;
        srm_config.in.pic_h = info.height;
        srm_config.in.block_w = crop_w;
        srm_config.in.block_h = crop_h;
        srm_config.in.block_offset_x = crop_x;
        srm_config.in.block_offset_y = crop_y;
        srm_config.in.srm_cm = VIDEO_PPA_COLOR_MODE;

        srm_config.out.buffer = lcd_buffer;
        srm_config.out.buffer_size = ALIGN_UP(DISPLAY_WIDTH * DISPLAY_HEIGHT * VIDEO_BYTES_PER_PIXEL, self->data_cache_line_size);
        srm_config.out.pic_w = DISPLAY_WIDTH;
        srm_config.out.pic_h = DISPLAY_HEIGHT;
        srm_config.out.block_offset_x = 0;
        srm_config.out.block_offset_y = 0;
        srm_config.out.srm_cm = VIDEO_PPA_COLOR_MODE;

        srm_config.rotation_angle = PPA_SRM_ROTATION_ANGLE_0;
        srm_config.scale_x = scale_x;
        srm_config.scale_y = scale_y;
        srm_config.mirror_x = 0;
        srm_config.mirror_y = 0;
        srm_config.rgb_swap = 0;
        srm_config.byte_swap = 0;
        srm_config.mode = PPA_TRANS_MODE_BLOCKING;

        esp_err_t ret = ppa_do_scale_rotate_mirror(self->ppa_srm_handle, &srm_config);
        if (ret != ESP_OK) {
            ESP_LOGE(ESP_UTILS_LOG_TAG, "PPA scale failed: %s", esp_err_to_name(ret));
            return;
        }

        ret = esp_lv_adapter_dummy_draw_flush_buf(self->display, lcd_buffer);
        if (ret != ESP_OK) {
            ESP_LOGE(ESP_UTILS_LOG_TAG, "Dummy draw flush failed: %s", esp_err_to_name(ret));
            return;
        }
    }

    void VideoPlayer::audioCallback(frame_data_t *data, void *arg)
    {
        VideoPlayer *self = static_cast<VideoPlayer *>(arg);
        if (!self || !self->audio_ready || !self->loop_playback ||
                !data || data->type != FRAME_TYPE_AUDIO || !data->data || data->data_bytes == 0) {
            return;
        }

        size_t bytes_written = 0;
        esp_err_t ret = bsp_extra_i2s_write(
            data->data,
            data->data_bytes,
            &bytes_written,
            1000
        );
        if (ret != ESP_OK || bytes_written != data->data_bytes) {
            ESP_LOGW(
                ESP_UTILS_LOG_TAG,
                "Audio write failed: %s, %u/%u bytes",
                esp_err_to_name(ret),
                static_cast<unsigned>(bytes_written),
                static_cast<unsigned>(data->data_bytes)
            );
        }
    }

    void VideoPlayer::audioSetClockCallback(uint32_t rate, uint32_t bits, uint32_t ch, void *arg)
    {
        VideoPlayer *self = static_cast<VideoPlayer *>(arg);
        if (!self || !self->audio_ready || !self->loop_playback) {
            return;
        }

        const uint32_t sample_rate = rate ? rate : CODEC_DEFAULT_SAMPLE_RATE;
        const uint32_t bit_width = bits ? bits : CODEC_DEFAULT_BIT_WIDTH;
        const i2s_slot_mode_t mode = (ch <= 1) ? I2S_SLOT_MODE_MONO : I2S_SLOT_MODE_STEREO;
        esp_err_t ret = bsp_extra_codec_set_fs(sample_rate, bit_width, mode);
        if (ret != ESP_OK) {
            ESP_LOGW(ESP_UTILS_LOG_TAG, "Audio clock setup failed: %s", esp_err_to_name(ret));
        }
    }

    void VideoPlayer::playEndCallback(void *arg)
    {
        VideoPlayer *self = static_cast<VideoPlayer *>(arg);
        self->is_playing = false;
    }

    bool VideoPlayer::shouldExitBySwipe()
    {
        if (!touch_handle) {
            return false;
        }

        esp_lcd_touch_read_data(touch_handle);

        esp_lcd_touch_point_data_t points[1] = {};
        uint8_t point_num = 0;
        esp_err_t ret = esp_lcd_touch_get_data(touch_handle, points, &point_num, 1);

        if (ret != ESP_OK || point_num == 0) {
            touch_active = false;
            return false;
        }

        if (!touch_active) {
            touch_active = true;
            touch_start_x = points[0].x;
            touch_start_y = points[0].y;
            return false;
        }

        int dx = abs((int)points[0].x - (int)touch_start_x);
        int dy = abs((int)points[0].y - (int)touch_start_y);
        return dx > SWIPE_EXIT_THRESHOLD || dy > SWIPE_EXIT_THRESHOLD;
    }

